controllers/DasarController.php

INSERT INTO `dasar` (`jenis`, `nomor`, `tanggal`, `perihal`, `isi`) VALUES ('Undang-Undang', '18 tahun 2016 ', NULL, 'Anggaran Pendapatan dan Belanja Negara Tahun 2017', 'Undang-Undang Nomor 18 tahun 2016 tentang Anggaran Pendapatan dan Belanja Negara Tahun 2017')
---
    public function actionCreate()
    {
        $model = new Dasar();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `dasar` WHERE `id`='0'
---
    protected function findModel($id)
    {
        if (($model = Dasar::findOne($id)) !== null) {